# ExportLineweightKey Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLineweightKey Class
Members See Also
---
A key used to represent an item stored in an ExportLineweightTable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ExportLineweightKey : IDisposable
```

Visual Basic
---
```text
Public Class ExportLineweightKey _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ExportLineweightKey : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExportLineweightKey
# See Also
ExportLineweightKey Members
Autodesk.Revit.DB Namespace